WELCOME_MESSAGE = "👋 Здравствуйте"

MAIN_MENU_MESSAGE = "Главное меню:"
REJECT_BUTTON = "❌ Отмена"
SKIP_BUTTON = "➡️Пропустить"
ACTION_REJECTED = "❌ Действие отменено!"
RETURN_BUTTON = "↩️ Назад"

MENU_BUTTON = "📃 Меню"
BOOKING_BUTTON = "🏨 Бронь столика"
CALL_BUTTON = "🤵 Вызов официанта"
ENTER_TABLE_NUMBER = "🤵 Выберете номер столика: "
MENU_TEXT = "📃 Меню:"

PRODUCT_TEXT = """<b>Категория:</b> {CATEGORY}

<b>{NAME}</b>

{DESCRIPTION}

<b>Стоимость:</b> {PRICE} руб."""

LEFT_EMOJI = "⬅️"
RIGHT_EMOJI = "➡️"

WAITER_NOTICE = "🤵 Столик {NUM} вызывает официанта!"
USER_WAITER_NOTICE = "✔️ Официант сейчас подойдет"
TABLE_BOOKING_NOTICE = "✔️ Столик забронирован"


ENTER_AMOUNT_PERSON = "🤵 Введите количество персон: "

ERROR_FORMAT_MESSAGE = "❌  Ошибка формата, введите другое значение: "

ENTER_NEED_TIME = "🤵 Введите желаемое время: "

BOOKING_NOTICE = """🤵  Новая бронь: 

Количество персон - {AMOUNT_PERSONS}
Время - {TIME}"""